src/Documents/ОткрытиеСтанции/ОткрытиеСтанции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОткрытиеСтанции</name>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СтатусСтанций/СтатусСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусСтанций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </resources>
  <dimensions>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСтанций/СтатусыСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСтанций</name>
  <enumValues>
    <name>Ок</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>ПрофилактическиеРаботы</name>
  </enumValues>
  <enumValues>
    <name>РаботыПоУлучшению</name>
  </enumValues>
  <enumValues>
    <name>РемонтныеРаботы</name>
  </enumValues>
  <enumValues>
    <name>Демонтаж</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОткрытиеСтанции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусСтанций
	Движения.СтатусСтанций.Записывать = Истина;
	Движение = Движения.СтатусСтанций.Добавить();
	Движение.Период = Дата;
	Движение.Станция = Станция;
	Движение.Состояние = Перечисления.СтатусыСтанций.Ок;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
